ciniml/portable_terminal/sdkconfig.defaults.esp32p4
# ESP32-P4 / M5Stack Tab5 specific defaults.

CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# PSRAM: Tab5 has 32MB hex-mode PSRAM @ 200 MHz.
# 1280x720x2 framebuffer = ~1.76 MB, so PSRAM is required for the LCD.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# Default console on the on-board USB-Serial-JTAG.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# FreeRTOS tick at 1 kHz for terminal-friendly latency.
CONFIG_FREERTOS_HZ=1000
